Documents/БудушиеПланы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Document>
		<Properties>
			<Name>БудушиеПланы</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>План</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бюджет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>До</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецПлана</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/БудушиеПланы/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Функция ПолучитьОбщуюСумму()
	ОбщаяСумма = 0;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(Кошелек.Сумма) КАК Сумма
	               |ИЗ
	               |	Справочник.Кошелек КАК Кошелек";
	//Запрос.УстановитьПараметр("ВладелецКошелька", ПараметрыСеанса.ИмяТекущегоПользователя);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаЗапроса = РезультатЗапроса.Выбрать();
	Пока ВыборкаЗапроса.Следующий() Цикл
		ОбщаяСумма = ОбщаяСумма + ВыборкаЗапроса.Сумма;	
	КонецЦикла;                            
	
	Возврат ОбщаяСумма
КонецФункции

&НаКлиенте
Процедура БюджетПриИзменении(Элемент)
	ОбщаяСуммаСчетов = ПолучитьОбщуюСумму();
	Если ЗначениеЗаполнено(Объект.План) и ЗначениеЗаполнено(Объект.Бюджет) Тогда
		Если ОбщаяСуммаСчетов >= Объект.Бюджет Тогда
			Сообщить("Для реализацци плана:" + " " + Объект.План + " " + "Хватает срдеств:" + Символы.ПС + "Остаток:" + " " + Строка((ОбщаяСуммаСчетов - Объект.Бюджет)));	
			//Не сохраняет в реквезит "Результат"
		Иначе
			Сообщить("Для реализацци плана:" + " " + Объект.План + " " + "Не хватает срдеств:" + Символы.ПС + "Необходимо еще:" + " " + СтрЗаменить(Строка((Объект.Бюджет - ОбщаяСуммаСчетов)),"-",""));
		КонецЕсли;	
	КонецЕсли
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.ВладелецПлана = ПараметрыСеанса.ИмяТекущегоПользователя;
КонецПроцедуры
